import img1 from "../assets/solid/1.jpg";
import img2 from "../assets/solid/2.jpg";
import img3 from "../assets/solid/3.jpg";
import img4 from "../assets/solid/4.jpg";
import img5 from "../assets/solid/5.jpg";
import img6 from "../assets/solid/6.jpg";
import img7 from "../assets/solid/7.jpg";
import img8 from "../assets/solid/8.jpg";
import img9 from "../assets/solid/9.jpg";
import img10 from "../assets/solid/10.jpg";

import img11 from "../assets/solid/11.jpg";
import img12 from "../assets/solid/12.jpg";
import img13 from "../assets/solid/13.jpg";
import img14 from "../assets/solid/14.jpg";
import img15 from "../assets/solid/15.jpg";
import img16 from "../assets/solid/16.jpg";
import img17 from "../assets/solid/17.jpg";
import img18 from "../assets/solid/18.jpg";
import img19 from "../assets/solid/19.jpg";
import img20 from "../assets/solid/20.jpg";

import img21 from "../assets/solid/21.jpg";
import img22 from "../assets/solid/22.jpg";
import img23 from "../assets/solid/23.jpg";
import img24 from "../assets/solid/24.jpg";
import img25 from "../assets/solid/25.jpg";
import img26 from "../assets/solid/26.jpg";
import img27 from "../assets/solid/27.jpg";
import img28 from "../assets/solid/28.jpg";
import img29 from "../assets/solid/29.jpg";
import img30 from "../assets/solid/30.jpg";

import img31 from "../assets/solid/31.jpg";
import img32 from "../assets/solid/32.jpg";
import img33 from "../assets/solid/33.jpg";
import img34 from "../assets/solid/34.jpg";
import img35 from "../assets/solid/35.jpg";
import img36 from "../assets/solid/36.jpg";
import img37 from "../assets/solid/37.jpg";
import img38 from "../assets/solid/38.jpg";
import img39 from "../assets/solid/39.jpg";
import img40 from "../assets/solid/40.jpg";

import img41 from "../assets/solid/41.jpg";
import img42 from "../assets/solid/42.jpg";
import img43 from "../assets/solid/43.jpg";
import img44 from "../assets/solid/44.jpg";
import img45 from "../assets/solid/45.jpg";
import img46 from "../assets/solid/46.jpg";
import img47 from "../assets/solid/47.jpg";
import img48 from "../assets/solid/48.jpg";
import img49 from "../assets/solid/49.jpg";
import img50 from "../assets/solid/50.jpg";

import img51 from "../assets/solid/51.jpg";
import img52 from "../assets/solid/52.jpg";
import img53 from "../assets/solid/53.jpg";
import img54 from "../assets/solid/54.jpg";
import img55 from "../assets/solid/55.jpg";
import img56 from "../assets/solid/56.jpg";
import img57 from "../assets/solid/57.jpg";
import img58 from "../assets/solid/58.jpg";
import img59 from "../assets/solid/59.jpg";
import img60 from "../assets/solid/60.jpg";

import img61 from "../assets/solid/61.jpg";
import img62 from "../assets/solid/62.jpg";
import img63 from "../assets/solid/63.jpg";
import img64 from "../assets/solid/64.jpg";
import img65 from "../assets/solid/65.jpg";
import img66 from "../assets/solid/66.jpg";
import img67 from "../assets/solid/67.jpg";
import img68 from "../assets/solid/68.jpg";
import img69 from "../assets/solid/69.jpg";
import img70 from "../assets/solid/70.jpg";

import img71 from "../assets/solid/71.jpg";
import img72 from "../assets/solid/72.jpg";
import img73 from "../assets/solid/73.jpg";
import img74 from "../assets/solid/74.jpg";
import img75 from "../assets/solid/75.jpg";
import img76 from "../assets/solid/76.jpg";
import img77 from "../assets/solid/77.jpg";
import img78 from "../assets/solid/78.jpg";
import img79 from "../assets/solid/79.jpg";
import img80 from "../assets/solid/80.jpg";

import img81 from "../assets/solid/81.jpg";
import img82 from "../assets/solid/82.jpg";
import img83 from "../assets/solid/83.jpg";
import img84 from "../assets/solid/84.jpg";
import img85 from "../assets/solid/85.jpg";
import img86 from "../assets/solid/86.jpg";
import img87 from "../assets/solid/87.jpg";
import img88 from "../assets/solid/88.jpg";
import img89 from "../assets/solid/89.jpg";
import img90 from "../assets/solid/90.jpg";

import img91 from "../assets/solid/91.jpg";
import img92 from "../assets/solid/92.jpg";
import img93 from "../assets/solid/93.jpg";
import img94 from "../assets/solid/94.jpg";

export const soldiers = [
  { id: 1, name: "סגן אבנת אליהו ז״ל", fallenText: "בן 20 בנופלו", image:img1, link: "/soldier/1" ,story:`"בן זאב ואסתר. נולד ביום א' באדר תש"ד (25.2.1944) בירושלים. התחיל ללמוד בבית-החינוך לילדי-העובדים בירושלים ובעבור המשפחה לכפר-ויתקין המשיך ללמוד שם בבית-הספר היסודי; בסיימו אותו למד בבית-ספר תיכון. השתייך לגדנ"ע-אויר ואחרי גיוסו לצה"ל באוגוסט 1961 עבר קורס-טיס, עסק בצניחה, ובשנת-שירותו האחרונה, אחרי שסייםבהצלחה קורס-קצינים, השתייך לסיירת-שריון, אשר בה מצא שדה-פעולה למרצו וליזמתו. הגיע לדרגת סגן-משנה. מילדותו התבלט בשקט הפנימי שלו ובענוותנותו. תמיד פעל והדריך והקדיש מחשבה ודאגה לבעיות שונות מתוך רצינות השופעת טוב. היטה אוזן לכל ועצתו עמדה תמיד במבחן היושן והמצפון. היה סמל האחריות והזהירות, ההתנהגות בחברה אשר בה נמצא וההתחשבות בזולתו. אמר להמשיך את לימודיו באוניברסיטה העברית בירושלים. נפל בשעת מילוי תפקידו ביום א' במרחשון תשכ"ה (7.10.1964) והובא למנוחת-עולמים בבית-הקברות בכפר-ויתקין."` },
   { id: 2, name: "סמל אלגמיז דניאל (דני) ז״ל", fallenText: "בן 20 בנופלו", image: img2, link: "/soldier/2" ,story:`בן שמעון ומרים. נולד ביום כ"ב באייר תש"ז (12.5.1947) בעיר איזמיר אשר בתורכיה. בשנת 1948 עלה לארץ עם הוריו. ביהוד סיים את לימודיו בבית הספר היסודי. בגלל נטייתו לספורט התמסר בעיקר למשחק כדורסל ושיחק בקבוצת "הפועל" ביהוד. את לימודיו התיכוניים למד בבית החינוך בירושלים ושהה בפנימיה "כרמית", שהיא פנימייה לתלמידים מחוננים. היה קשור מאוד לביתו ובכל מעשיו והחלטותיו שקל את תגובת הוריו ואחיותיו. בפנימיה היה אהוב על חבריו וידידותו עמם נשמרה גם בשעת שירותו הצבאי. כאשר גויס לצה"ל שימש כמש"ק הדרכה בבית הספר לשריון (בדרגת סמל). עמד להשתחרר מן הצבא ולשוב אל משפחתו ואל לימודיו. התקופה שלפני מלחמת ששת הימים היתה רבת מתח ועצבנות אך הוא היה ער ורענן ומסוגל לבצע כל משימה, כפי שמפקד חטיבתו כתב עליו במכתבו למשפחה השכולה. באותו מכתב מספר המפקד כי בתקופה ההיא ביקש דני להעביר אותו לתפקיד של מפקד טנק צנטוריון כי הוא לא ראה את תפקידו כתפקיד קרבי למדי וחשב כי יש ביכולתו לתרום למאמץ המלחמתי יותר. בימים שלפני המלחמה ובמלחמה עצמה שימש כמש"ק מבצעים במפקדה הראשית. ביום הראשון לקרבות, הוא כ"ו באייר תשכ"ז (5.6.1967), נפל בקרב שנערך דרומית לצומת רפיח, כשהוא ממלא את תפקידו בנאמנות. הובא לקבורה בבית הקברות הצבאי לשעת חירום בבארי ולאחר זמן הועבר למנוחת עולמים בבית הקברות הצבאי שעל הר הרצל בירושלים. להנצחת זכרו ייסדו הוריו של דניאל קרן מילגות הנקראת "יד דניאל" והמילגות תינתנה לילדי יהוד, בוגרי בתי ספר תיכוניים הממשיכים בלימודיהם.` },
  { id: 3, name: "טוראי אסולין דויד ז״ל", fallenText: "בן 18 בנופלו", image: img3, link: "/soldier/3" ,story:`בן יחיא ופרחה. נולד בשנת תש"י (1950) במרקש שבמרוקו. המשפחה עלתה לארץ בשנת 1956 ואז התחיל את לימודיו היסודיים בבית הספר "רמב"ם" שבנהריה. שם גדל באווירה של אהבה לים וחלם להשתלם בבית ספר לקציני ים בעכו. בגיל י"ב נתיתם מאביו וכעבור שנתיים עבר לבית הספר המקצועי "אורט". הוא למד את מקצוע הנגרות והשתלם בנגריית המושב השיתופי רגבה שבגליל המערבי. השתייך לתנועת "הנוער העובד" והשתתף בקביעות בפעולות תרבות של מועדון הנוער. בין תחביביו השונים אפשר למנות איסוף קריקטורות ובולים. חיוך נלבב היה מרחף על שפתיו תמיד ומבטו החינני שבה כל לב. דויד החליט להצטרף לשורות צה"ל לפני בוא הזמן, בגיל י"ז, ובנובמבר 1967 גויס לצה"ל והוצב לחיל השריון. הוא יצא לצבא כשבתרמילו טלית ותפילין, כי את אלה לא נטש מאז היותו בר-מצוה. היו לו תכניות להמשיך בלימודיו אחרי שירותו הצבאי, לפי דברי אחיו מוריס הבטיח לאמו לדאוג לה גם כשיצא מן הבית להמשכת לימודיו. אחד מתחביביו היה להתאמן בקליעה ברובה אויר ובאימון גופני, כל אלה, בלי ספק, יסייעו לו בשירותו הצבאי. בשירותו הוכיח את עצמו כחייל ממושמע, בעל יזמה ותושיה רבה. הוא עמד על רמה מקצועית גבוהה וביצע את כל שהוטל עליו בצורה טובה. שאיפתו היתה לעלות בסולם הדרגות, כי את הצבא אהב, אבל ביום ט"ו באלול תשכ"ח (8.9.1968) בא הקץ לשירותו הצבאי בשמשו כטען-קשר בטנק שנפגע ישירות על ידי פגז האויב; זה היה ליד גשר פירדן - והוא טרם הגיע לסוף שירות החובה שלו. הובא למנוחת עולמים בבית הקברות הצבאי בנהריה. מפקד יחידתו כתב במכתב תנחומיו למשפחתו כי דויד התבלט בהכרתו האישית בייעודו של צה"ל לאחר מלחמת ששת הימים. לא התאונן ולא ביקש חופשה מיוחדת למרות בעיותיו ותמיד היה פותר אותן בעצמו. דויד מאוד אהוב היה על חבריו ותמיד הצטיין בעבודתו בתוך צוות כי היה מגיש את עזרתו לחבריו. וכן סיים המפקד את מכתבו: "רצוני שתדעו, כי בנכם לא נפל לשוא כי אם על הגנת המולדת - נכס שהוא יקר לכל עם ישראל".`},
  { id: 4, name: "רב״ט אפריאט מרדכי (מרקו) ז״ל", fallenText: "בן 19 בנופלו", image: img4, link: "/soldier/4" ,story:`מרדכי, בן חנה ומאיר, נולד ביום ב' בניסן תשי"ד (5.4.1954) במרקש שבמרוקו, ועלה ארצה עם משפחתו בנובמבר 1956. המשפחה השתקעה בירושלים והוא למד בבית-הספר היסודי "ישורון". אחרי-כן סיים את לימודיו בבית-הספר התיכון העירוני ג' (בית-חינוך) ועמד בהצלחה בבחינות הבגרות. מרדכי, שנקרא בפי הכל מוטי, היה נער ישר-דרך ורודף אמת וצדק. הוא היה נעים-הליכות, עדין-נפש וידע לכבד את בני משפחתו ואת חבריו ומכריו. חבריו ובני משפחתו אהבו להיות במחיצתו והעריכו את נימוסיו הטובים, את טוב-לבו ואת נכונותו לסייע לכל דורש, בעצה ובמעשה. מוטי בילה את זמנו הפנוי בקריאת ספרות מופת ובעיסוק בספורט. הוא הצטיין בעיקר בענף הכדורסל ונמנה על סגל נבחרת בית-ספרו בענף ספורט זה. הוא ניחן בקול ערב ונהג לשיר, כשהוא מלווה את שירתו בנגינה בגיטרה. הוא יזם וארגן מסיבות וערבי-הווי, בהם היה משמיע שירים לחבריו ללימודים ואחרי-כן לחבריו לשירות. בשנת 1969 נפטר אביו ומרדכי נטל על עצמו את עול הדאגה והטיפול במשפחה. הוא ניסה לסייע לאמו ולהקל עליה בבדידותה.

מרדכי גויס לצה"ל בתחילת אוגוסט 1972 והוצב לחיל השריון. לאחר סיום הטירונות הוכשר לשמש כאיש צוות טנק ונשלח לשרת בגדוד טנקים בסיני. הוא היה חייל מסור וממושמע, אהוד על חבריו ומקובל על מפקדיו. במלחמת יום-הכיפורים יצאה יחידתו לעבר תעלת סואץ, ללחום במצרים שצלחו את התעלה. ביום י"א בתשרי תשל"ד (7.10.1973) בקרב לחילוץ לוחמי צה"ל שהיו נצורים במעוזים, נפגע מרדכי ונהרג. לאחר שהיה נעדר כחמישה חודשים הובא למנוחת-עולמים בבית-העלמין בהר-הרצל בירושלים. השאיר אחריו אם, חמש אחיות ושלושה אחים. לאחר נופלו הועלה לדרגת רב-טוראי.

במכתב תנחומים למשפחה השכולה כתב מפקד היחידה: "קבלי נא את השתתפותי הכנה בצערך על נפילתו של מרדכי ז"ל. מרדכי שירת ביחידתי כאיש צוות טנק. הוא נפל בעת מילוי תפקידו, בלילה הראשון של מלחמת יום-הכיפורים, בעת ניסיון להדוף את האויב המצרי בגזרה הדרומית של תעלת סואץ, באזור מעוזי 'ליטוף'. אנו, מפקדי היחידה וחבריו של מרדכי, חיילי היחידה, נושאים בגאון ובחרדת-קודש את זכרו".` },
  { id: 5, name: "סמל אשכנזי אורי נחמיה ז״ל", fallenText: "בן 19 בנופלו", image: img5, link: "/soldier/5" ,story:`בנם של רויטל ודוד. נולד ביום ט"ו בסיוון תשס"ה (21.6.2005) באשקלון. אח קטן לשלו, אח גדול לטוהר.

אורי גדל והתחנך באשקלון, למד בבית ספר יסודי "נוף ים ב'" ובתיכון "מקיף ה' דרכא" בעיר. ילד שמח, אהוב ומוקף בחברים. כבר בגן קיבל מהגננת את הכינוי "ביצת הפתעה", כי תמיד המציא תחבולות שובבות ומפתיעות, מלוות בחיוך מתוק וחינני שלא אפשר לאיש לכעוס עליו.

מגיל צעיר גילה כישרון למשחקי מחשב, במיוחד "פיפ"א" ו"פורטנייט", בהם שיחק שעות. הוא אהב מאוד ספורט ובמיוחד כדורגל, היה אוהד מושבע של קבוצת "ברצלונה" והשחקן האהוב עליו היה מסי. כן נהג לצפות במשחקי ליגת האגרוף WWE.

בתיכון למד במגמת דיפלומטיה ותקשורת באנגלית וכן במגמת ספורט של מכון וינגייט. אורי התאמן כל יום בחדר הכושר, הקפיד על תזונה בריאה ואף הוסמך כמדריך כושר מטעם המכללה האקדמית וינגייט.

בתחילת כיתה י"א, אורי ניגש יום אחד למחנך שלו והודיע לו בהמשך לשיחה שקיימו ימים אחדים קודם שמצא ייעוד לחיים, וכי הוא רוצה להיות לוחם בצה"ל בשירות משמעותי ולהקדיש לזה את מירב הכוחות והמאמץ. והוא אכן עשה שינוי מדהים בפיתוח הגוף, לצד האימונים המסיביים היומיומיים בחדר כושר.

כשהיה בן שש-עשרה וחצי הכיר את שיר, אהבתו הראשונה והגדולה. השניים למדו באותה השכבה בתיכון, הכירו ביום ההולדת של אורי והפכו לזוג בתקופת הבגרויות. "הוא אהב אותה מאוד, הם היו כל הזמן ביחד. הוא תמיד אמר שהוא רוצה להתחתן איתה", סיפר אחיו, שלו.

בכיתה י"ב השתתף בפרויקט "מודל האו"ם HeyMun", פרויקט גמר בינלאומי במסגרתו תלמידים וסטודנטים מדמים את פעולות האו"ם. יכולות ההנהגה הטבעיות שלו הובילו לבחירתו כאחד משני המנחים של האירוע, ובאסרטיביות השקטה שלו הוא הצליח לנהל את הדיון בצורה הוגנת ושוויונית, לתת לכל אחד מהמשתתפים את הבמה ולאפשר להם לבוא לידי ביטוי.

אורי היה אדם מלא שמחת חיים, מצחיק ומפיץ סביבו אור, כשמו. הוא גם נולד ביום עם הכי הרבה שעות אור בשנה, 21 ביוני. סובביו קראו לו "מלך בלייצר חיים". תמיד גילה אופטימיות, רגישות ואכפתיות לסובביו, ידע להקשיב ולנסוך תחושת ביטחון ורוגע ושאף שיהיה טוב ושמח לכולם. גם כשהתמודד עם אתגרים ועם פחדים, ידע להתגבר עליהם ולמצוא את הדרך להמשיך בדרכו. המוטו שלו היה: "הכול יהיה טוב בסוף, ואם לא טוב אז זה לא הסוף", ובדרך כלל כתב אותו באנגלית:

Everything will be okay at the end, and if it's not okay, it's not the end.

הוא אהב את החיים הטובים – מסעדות, בילויים, חופשות בבתי מלון, נהג לכתוב בפנקס בדיחות על כל החברים ולצלם סרטונים מצחיקים. היו לו חלומות רבים לעתיד, והגדול שבהם, שאותו גם זכה להגשים, היה להגן על המדינה.

בשבת כ"ב בתשרי, שמחת תורה תשפ"ד, 7 באוקטובר 2023, בשעה שש וחצי בבוקר, פתח ארגון הטרור חמאס במתקפת פתע על ישראל. בחסות ירי מסיבי של טילים ורקטות מרצועת עזה לאזורים נרחבים בארץ חדרו אלפי מחבלים – יבשתית, ימית ואווירית, והחלו במתקפה רצחנית על יישובי עוטף עזה ועל שדרות, אופקים ונתיבות, על מְבַלי מסיבות טבע סמוך לקיבוצים רעים ונירים, על בסיסי צה"ל ועל העוברים בדרכים באזור. המחבלים רצחו כשמונה-מאות אזרחים בבתיהם, במכוניותיהם, אחרי שביצעו בהם פשעים כבדים. חטפו לרצועת עזה מאות ישראלים והחריבו, בזזו והעלו באש בתים ורכוש. מאות חיילים, שוטרים, אנשי כוחות הביטחון וחברי כיתות הכוננות המקומיות נפלו בקרב. בבוקר זה החלה מלחמה.

אורי היה אז לקראת גיוס, ובעקבות המאורעות החליט להתגייס ליחידה הקרבית ביותר. לחבריו אמר שהמלחמה הזו היא ערכית ומוצדקת ביותר, והוא שואף לתרום בה את חלקו.

ב-3.12.2023 התגייס לצה"ל ושירת בחיל השריון, כלוחם בגדוד 46 של עוצבת "עקבות הברזל" (401). בתחילה התאכזב מהשיבוץ, אך כששמע עוד על התפקיד והבין כמה הוא משמעותי, החליט להתמסר לו ולעשות את הטוב ביותר.

בשלב מסוים התבקש על ידי המפקדים לכתוב את ה"למה" שלו – מה מניע אותו לעשות את מה שהוא עושה. אורי כתב: "להתחשל ולהתבגר בתור בן אדם, להכיר חברים לכל החיים, לצבור חוויות, תחושת סיפוק. לצאת לפיקוד ולקצונה בסופו של דבר ולחתום קבע, לסיים עם קריירה צבאית איכותית. להגן על אזרחיה של מדינת ישראל ולשמור על ביטחונם, לנצח את המלחמה הבאה, להילחם למען המדינה, לחיות".

חבריו לשירות העניקו לו את הכינוי "א.א.א" – אורי אחראי אווירה. תמיד הרים את המורל, אהב לצחוק ולהצחיק, לשמוח ולשמח. בכל משימה שקיבל ניסה להגדיל ראש, ללמוד את הדברים גם מעבר להגדרות התפקיד שלו ולהבין אותם לעומקם. ברגעים קשים נהג לומר: "זו המשמרת שלי עכשיו, ואני אהיה היכן שצריכים אותי".

בשל המלחמה, עבר טירונות מקוצרת ומיד לאחריה הצטרף עם הפלוגה שלו ללחימה הקרקעית ברצועת עזה. באותו הזמן, בת זוגו שיר סיימה קורס חובשים ואורי החל להתלבט בעצמו בין יציאה לקורס מפקדים לבין קורס חובשים. הוא שוחח על כך עם הרופאה הפלוגתית שהתלהבה ממנו מאוד, ובעקבות השיחה סוכם עם מפקד הפלוגה שברגע שיגיע צוות חדש, אורי ייצא לקורס חובשים. אך הוא לא הספיק להגשים את התוכנית.

ביום 22 באוגוסט, בעת פעילות מבצעית ברפיח לחילוץ חטופים במנהרה בתל סולטן, נורה טיל נ"ט (נגד טנקים) לעבר הטנק שבו שהה. אורי נפגע מרסיסים ונהרג במקום.

רב-טוראי אורי נחמיה אשכנזי נפל בקרב ביום י"ח באב תשפ"ד (22.8.2024). בן תשע-עשרה וחודשיים בנופלו. הובא למנוחות בבית העלמין הצבאי באשקלון. הותיר אחריו הורים, אחות ואח.

לאחר נפילתו הועלה לדרגת סמל.

אורי השאיר אחריו מכתב ובו כתב: "חייתי חיים נפלאים, ללא חרטות. עם המשפחה ובת הזוג הכי מדהימים שיש. אני אוהב אתכם המון ומצטער אם גרמתי לכם לכאב. עשיתי את מה שעשיתי ואת השירות הזה מתוך אהבה גדולה למדינה המוזרה שלנו, ואם הצלחתי וקידשתי חיי אדם בלכתי – אני לא מצטער על כלום, הצלחתי ונכשלתי במשימתי בו זמנית.

"אמא ואבא, אני מודה לכם על הכול – מה שעשיתם בשבילי ולמעני לאורך כל חיי. הערכתי את זה תמיד, גם אם לא הראיתי זאת. אני רוצה לראות אתכם שמחים ומאושרים ושיהיה לכם סיפוק נצחי. שלו וטוהר – תמשיכו ותצליחו בחיים שלכם. אתם כל כך מיוחדים וחכמים, אין לי ספק שתגיעו רחוק. אל תשכחו שאני מסתכל עליכם מלמעלה.

"המשפחה המורחבת, תודה לכם על השבתות והזיכרונות שלא אשכח, על צחוק וחיוך שלא יורד מהפנים. תודה מיוחדת לסבא וסבתא שגידלו אותי ועשו מעל ומעבר בשבילי. שיר דובי שלי, הדבר הראשון שאני רוצה לומר לך הוא תודה רבה שלימדת אותי מה זו אהבה ראשונה, ועל תקופה שאנצור לעד. על הרבה רגעים וזיכרונות מיוחדים, אוהב אותך לנצח.

"עכשיו, כשסיימנו עם החלק הקיטשי והגענו ללוויה, אמא אני מבקש בלי נאומים סוחטי דמעות ומרגשים – בלי להביך. אין לי הרבה בקשות, מלבד זה שתשאירו את החדר שלי כמו שהוא... אוהב אתכם לנצח ואשמור עליכם לנצח, אורי. והחלק הכי חשוב שכמעט שכחתי – אשמח שתמשיכו אותי הלאה".

אימו, רויטל, ספדה לו: "חבל הטבור שלנו לא ייחתך אף פעם. אני לא צריכה לדבר על זה שאורי הוא החמצן שלי... אמרת לי 'אימא, אני אוהב אותך בשביל חיים שלמים'. אלוהים נתן לי מתנה, תשע-עשרה שנים וחודשיים, מהדורה מיוחדת... הוא היה ילד של אימא שלו – הכי יפה, הכי מוצלח, הכי חכם, עם אינטליגנציה רגשית שאין כמוה".

"בקצת הזמן שהיית פה איתנו הספקת להדגים ולהראות לנו מה זו אהבה טובה ותמימה, אהבה ללא תנאי, אהבה בלי פוזה וציניות", כתבה דודתו, טלי. "לימדת אותנו כמה חשוב לחיות כל יום כאילו הוא היום האחרון – לחייך, לצחוק, לעשות שטויות, להנות משווארמה בלילה ומפיצה ענקית בלי נקיפות מצפון, להתרגש מברכות יום הולדת מצחיקות, לא לבזבז את הזמן ואת האנרגיות על כעסים וסכסוכים.

"לימדת אותנו מה זה לחבק חזק, מה זה לחייך גם כשכואב, מה זה לדאוג לאנשים הקרובים, להכיל את השריטות של כולם ולהישאר השפוי היחיד... פספסנו אותך ילד, העולם כולו פספס אותך".

תמונתו של אורי צוירה על גבי מיגונית באשקלון, הנמצאת סמוך למגרש הספורט בו נהג לשחק.

עמוד לזכרו נפתח באתר ההנצחה של אוהדי "מכבי חיפה" שנפלו במלחמה.

עמוד נוסף לזכרו נפתח באינסטגרם, תחת השם remember.ori.ashkenazi. בעמוד תמונות, סרטונים וסיפורים מתחנות חייו השונות.

משנת 2025 והלאה פרויקט "מודל האו"ם HeyMun" שאורי הוביל בכיתתו בתיכון ייקרא על שמו, להנציח את אורו וערכיו.

כתב אחיו, שלו: "ההקרבה של אורי בקרב, כמו של לוחמים רבים אינה לחינם. אנחנו נמשיך לחיות אותם בתוכנו, הם נתנו לנו את הזכות לבנות עתיד טוב יותר במדינה, וויתרו על העתיד שלהם. אורי, נחזיק את לפיד האור שלך גבוה, לנצח!"` },
  { id: 6, name: "סגן בדיחי גיל ז״ל", fallenText: "בן 22 בנופלו", image: img6, link: "/soldier/6" },
  { id: 7, name: "רב״ט בובליל הרצל ז״ל", fallenText: "בן 19 בנופלו", image: img7, link: "/soldier/7" },
  { id: 8, name: "סגן בוגלר דוד (דובי) ז״ל", fallenText: "בן 21 בנופלו", image: img8, link: "/soldier/8" },
  { id: 9, name: "סמ״ר בונימוביץ אלכסנדר ז״ל", fallenText: "בן 19 בנופלו", image: img9, link: "/soldier/9" },
  { id: 10, name: "טוראי בלום חיים ז״ל", fallenText: "בן 19 בנופלו", image: img10, link: "/soldier/10" },
  { id: 11, name: "סרן בן-פנחס אברהם ז״ל", fallenText: "בן 24 בנופלו", image: img11, link: "/soldier/11" },
  { id: 12, name: "סג״מ בן-דרור שמעון ז״ל", fallenText: "בן 22 בנופלו", image: img12, link: "/soldier/12" },
  { id: 13, name: "טוראי בן-נעים אלברט ז״ל", fallenText: "בן 21 בנופלו", image: img13, link: "/soldier/13" },
  { id: 14, name: "סמל בסנצ׳י אליהו ז״ל", fallenText: "בן 20 בנופלו", image: img14, link: "/soldier/14" },
  { id: 15, name: "סמ״ר ברבי הרצל-אליהו (אלי) ז״ל", fallenText: "בן 20 בנופלו", image: img15, link: "/soldier/15" },
  { id: 16, name: "סרן ברוידא צבי (ציקי) ז״ל", fallenText: "בן 22 בנופלו", image: img16, link: "/soldier/16" },
  { id: 17, name: "סגן ברמן דניאל ז״ל", fallenText: "בן 22 בנופלו", image: img17, link: "/soldier/17" },
  { id: 18, name: "טוראי ברמץ אבינועם (אבי) ז״ל", fallenText: "בן 19 בנופלו", image: img18, link: "/soldier/18" },
  { id: 19, name: "סמ״ר גאוי עמוס ז״ל", fallenText: "בן 21 בנופלו", image: img19, link: "/soldier/19" },
  { id: 20, name: "סמל גוטמכר בנימין (בנו) ז״ל", fallenText: "בן 20 בנופלו", image: img20, link: "/soldier/20" },
  { id: 21, name: "סרן גוטמן ישראל (גוצי) ז״ל", fallenText: "בן 25 בנופלו", image: img21, link: "/soldier/21" },
  { id: 22, name: "סמ״ר גורטובניק שלמה ז״ל", fallenText: "בן 21 בנופלו", image: img22, link: "/soldier/22" },
  { id: 23, name: "סמ״ר גורן אדם ז״ל", fallenText: "בן 21 בנופלו", image: img23, link: "/soldier/23" },
  { id: 24, name: "סמל גלנץ צבי-שמחה (צביקה) ז״ל", fallenText: "בן 21 בנופלו", image: img24, link: "/soldier/24" },
  { id: 25, name: "סרן גלעדי אמנון ז״ל", fallenText: "בן 23 בנופלו", image: img25, link: "/soldier/25" },
  { id: 26, name: "סגן גנזך אברהם-יוסף (אבי) ז״ל", fallenText: "בן 22 בנופלו", image: img26, link: "/soldier/26" },
  { id: 27, name: "רב״ט גסנר יצחק-רוני ז״ל", fallenText: "בן 19 בנופלו", image: img27, link: "/soldier/27" },
  { id: 28, name: "סמ״ר גרוסמן אורי ז״ל", fallenText: "בן 21 בנופלו", image: img28, link: "/soldier/28" },
  { id: 29, name: "סמ״ר דונבצקי בוריס ז״ל", fallenText: "בן 21 בנופלו", image: img29, link: "/soldier/29" },
  { id: 30, name: "סגן הלפרין בצלאל (צאלי) ז״ל", fallenText: "בן 21 בנופלו", image: img30, link: "/soldier/30" },
  { id: 31, name: "רב״ט ואקנין חרמון ז״ל", fallenText: "בן 20 בנופלו", image: img31, link: "/soldier/31" },
  { id: 32, name: "סגן וולף אייל ז״ל", fallenText: "בן 22 בנופלו", image: img32, link: "/soldier/32" },
  { id: 33, name: "סמל וילנסקי מיכאל (מיקי) ז״ל", fallenText: "בן 21 בנופלו", image: img33, link: "/soldier/33" },
  { id: 34, name: "רס״ל זהבי צופר ז״ל", fallenText: "בן 22 בנופלו", image: img34, link: "/soldier/34" },
  { id: 35, name: "רב״ט חג׳אג׳ אליהו ז״ל", fallenText: "בן 20 בנופלו", image: img35, link: "/soldier/35" },
  { id: 36, name: "רב״ט חדד אליהו ז״ל", fallenText: "בן 19 בנופלו", image: img36, link: "/soldier/36" },
  { id: 37, name: "סמל חדד ציון ז״ל", fallenText: "בן 21 בנופלו", image: img37, link: "/soldier/37" },
  { id: 38, name: "רב״ט חסון מרדכי (מוטי) ז״ל", fallenText: "בן 20 בנופלו", image: img38, link: "/soldier/38" },
  { id: 39, name: "טוראי טייב אלפרד (פרדי) ז״ל", fallenText: "בן 18 בנופלו", image: img39, link: "/soldier/39" },
  { id: 40, name: "סמל יוסף רחמים ז״ל", fallenText: "בן 20 בנופלו", image: img40, link: "/soldier/40" },
  { id: 41, name: "סגן ימין חיים ז״ל", fallenText: "בן 22 בנופלו", image: img41, link: "/soldier/41" },
  { id: 42, name: "רב״ט כהן אלעזר ז״ל", fallenText: "בן 19 בנופלו", image: img42, link: "/soldier/42" },
  { id: 43, name: "רב״ט כהן ליאון ז״ל", fallenText: "בן 19 בנופלו", image: img43, link: "/soldier/43" },
  { id: 44, name: "סרן כהן נתן ז״ל", fallenText: "בן 23 בנופלו", image: img44, link: "/soldier/44" },
  { id: 45, name: "רב״ט כהן עובדיה ז״ל", fallenText: "בן 19 בנופלו", image: img45, link: "/soldier/45" },
  { id: 46, name: "רב״ט כהנים רחל (רוחל׳ה) ז״ל", fallenText: "בת 19 בנופלה", image: img46, link: "/soldier/46" },
  { id: 47, name: "סמל לבני בעז ז״ל", fallenText: "בן 20 בנופלו", image: img47, link: "/soldier/47" },
  { id: 48, name: "רב״ט לובצקי רון (רוני) ז״ל", fallenText: "בן 21 בנופלו", image: img48, link: "/soldier/48" },
  { id: 49, name: "טוראי מלמד משה (מוסקו) ז״ל", fallenText: "בן 20 בנופלו", image: img49, link: "/soldier/49" },
  { id: 50, name: "סרן מרדיקס ירון (רוני) ז״ל", fallenText: "בן 22 בנופלו", image: img50, link: "/soldier/50" },

  { id: 51, name: "רב״ט מרדכי נדיב ז״ל", fallenText: "בן 21 בנופלו", image: img51, link: "/soldier/51" },
  { id: 52, name: "רב״ט נגר יחיאל ז״ל", fallenText: "בן 20 בנופלו", image: img52, link: "/soldier/52" },
  { id: 53, name: "סמל נח אפרים (אפי) ז״ל", fallenText: "בן 20 בנופלו", image: img53, link: "/soldier/53" },
  { id: 54, name: "טוראי נחום אברהם (אבי) ז״ל", fallenText: "בן 18 בנופלו", image: img54, link: "/soldier/54" },
  { id: 55, name: "רב״ט סבן עמוס (ג׳וג׳ו) ז״ל", fallenText: "בן 32 בנופלו", image: img55, link: "/soldier/55" },
  { id: 56, name: "רב״ט סבשי ברוך ז״ל", fallenText: "בן 20 בנופלו", image: img56, link: "/soldier/56" },
  { id: 57, name: "סרן סגל איתן ז״ל", fallenText: "בן 22 בנופלו", image: img57, link: "/soldier/57" },
  { id: 58, name: "רב״ט סובה אבנר ז״ל", fallenText: "בן 19 בנופלו", image: img58, link: "/soldier/58" },
  { id: 59, name: "רב״ט סויסה יעיש ז״ל", fallenText: "בן 19 בנופלו", image: img59, link: "/soldier/59" },
  { id: 60, name: "רב״ט סחייק יצחק (איסי) ז״ל", fallenText: "בן 18 בנופלו", image: img60, link: "/soldier/60" },
  { id: 61, name: "רב״ט סאלם מנחם ז״ל", fallenText: "בן 19 בנופלו", image: img61, link: "/soldier/61" },
  { id: 62, name: "סמל סקנטיה שלמה ז״ל", fallenText: "בן 21 בנופלו", image: img62, link: "/soldier/62" },
  { id: 63, name: "סמ״ר ענבר בני (בדרי) ז״ל", fallenText: "בן 23 בנופלו", image: img63, link: "/soldier/63" },
  { id: 64, name: "רב״ט פאר זאב (זאבי׳לה) ז״ל", fallenText: "בן 19 בנופלו", image: img64, link: "/soldier/64" },
  { id: 65, name: "סמ״ר פוגל איתי ז״ל", fallenText: "בן 22 בנופלו", image: img65, link: "/soldier/65" },
  { id: 66, name: "סמ״ר פוזניאק זאב ז״ל", fallenText: "בן 22 בנופלו", image: img66, link: "/soldier/66" },
  { id: 67, name: "סגן פונדק אורי ז״ל", fallenText: "בן 21 בנופלו", image: img67, link: "/soldier/67" },
  { id: 68, name: "רס״ל פיירברגר מאיר ז״ל", fallenText: "בן 21 בנופלו", image: img68, link: "/soldier/68" },
  { id: 69, name: "סמ״ר פישר נבו ז״ל", fallenText: "בן 20 בנופלו", image: img69, link: "/soldier/69" },
  { id: 70, name: "סגן פלאי גולן (לני) ז״ל", fallenText: "בן 22 בנופלו", image: img70, link: "/soldier/70" },
  { id: 71, name: "טוראי פלח עמוס ז״ל", fallenText: "בן 19 בנופלו", image: img71, link: "/soldier/71" },
  { id: 72, name: "רב״ט פלט יאיר ז״ל", fallenText: "בן 19 בנופלו", image: img72, link: "/soldier/72" },
  { id: 73, name: "סמ״ר פריש מוניק ז״ל", fallenText: "בן 21 בנופלו", image: img73, link: "/soldier/73" },
  { id: 74, name: "סמ״ר פרל מתיתיהו יעקב ז״ל", fallenText: "בן 22 בנופלו", image: img74, link: "/soldier/74" },
  { id: 75, name: "טוראי צור צבי (צביקה) ז״ל", fallenText: "בן 25 בנופלו", image: img75, link: "/soldier/75" },
  { id: 76, name: "סמ״ר קאסה קנאו ז״ל", fallenText: "בן 22 בנופלו", image: img76, link: "/soldier/76" },
  { id: 77, name: "רב״ט קולנגי יצחק ז״ל", fallenText: "בן 19 בנופלו", image: img77, link: "/soldier/77" },
  { id: 78, name: "סמל רבין דניאל (דני) ז״ל", fallenText: "בן 21 בנופלו", image: img78, link: "/soldier/78" },
  { id: 79, name: "רב״ט רוזנברג אפרים-צבי ז״ל", fallenText: "בן 19 בנופלו", image: img79, link: "/soldier/79" },
  { id: 80, name: "טר״ש רולר יצחק (ישמר) ז״ל", fallenText: "בן 24 בנופלו", image: img80, link: "/soldier/80" },
  { id: 81, name: "סרן רוקח אריה-נח (ליאון) ז״ל", fallenText: "בן 22 בנופלו", image: img81, link: "/soldier/81" },
  { id: 82, name: "רס״ן ריין בניה ז״ל", fallenText: "בן 27 בנופלו", image: img82, link: "/soldier/82" },
  { id: 83, name: "טוראי שינה דויד ז״ל", fallenText: "בן 29 בנופלו", image: img83, link: "/soldier/83" },
  { id: 84, name: "סמל שמיר אלון-מרדכי ז״ל", fallenText: "בן 21 בנופלו", image: img84, link: "/soldier/84" },
  { id: 85, name: "סמ״ר שמר דרור ז״ל", fallenText: "בן 24 בנופלו", image: img85, link: "/soldier/85" },
  { id: 86, name: "סמל שרעבי יהונתן (יוני) ז״ל", fallenText: "בן 20 בנופלו", image: img86, link: "/soldier/86" },
  { id: 87, name: "סרן עידו וולוך ז״ל", fallenText: "בן 21 בנופלו", image: img87, link: "/soldier/87" },
  { id: 88, name: "סג״מ יורם אואנונו ז״ל", fallenText: "בן 20 בנופלו", image: img88, link: "/soldier/88" },
  { id: 89, name: "טוראי מתניה בר-לב ז״ל", fallenText: "בן 21 בנופלו", image: img89, link: "/soldier/89" },
  { id: 90, name: "טוראי יהודה וינר ז״ל", fallenText: "בן 19 בנופלו", image: img90, link: "/soldier/90" },

  { id: 91, name: "רב״ט יצחק סמוחה ז״ל", fallenText: "בן 19 בנופלו", image: img91, link: "/soldier/91" },
  { id: 92, name: "טוראי יצחק עטר ז״ל", fallenText: "בן 19 בנופלו", image: img92, link: "/soldier/92" },
  { id: 93, name: "טוראי שלום שלומאלי ז״ל", fallenText: "בן 25 בנופלו", image:img93, link: "/soldier/93" },
  { id: 94, name: "רב״ט שמעיה יוסף ז״ל", fallenText: "בן 19 בנופלו", image: img94, link: "/soldier/94" },
];