import img1 from "../assets/tlas/1.png";
import img2 from "../assets/tlas/2.png";
import img3 from "../assets/tlas/3.png";
import img4 from "../assets/tlas/4.png";
import img5 from "../assets/tlas/5.png";
import img6 from "../assets/tlas/6.png";
import img7 from "../assets/tlas/7.png";
import img8 from "../assets/tlas/8.png";
import img9 from "../assets/tlas/9.png";
import img10 from "../assets/tlas/10.png";
import img11 from "../assets/tlas/11.png";
import img12 from "../assets/tlas/12.png";
import img13 from "../assets/tlas/13.png";
import img14 from "../assets/tlas/14.png";


export const tzalashSoliders = [
    { id: 1, story: ` ביום ה-5 ביוני 1967, בקרב על רפיח, פרץ סמל שלום נסים עם הטנק שלו והסתער על האויב, למרות שהיו לו מעצורים בכלי הנשק. תוך כדי הקרב סיכן את עצמו בחלצו צוות, שנפגע מטנק אויב. לאחר מכן חילץ סמל שלום נסים פצוע, וטיפל בו עד שהצליח לפנותו. בכך הציל את חייו. על מעשה זה הוענק לו : עיטור המופת ניסן תשל"ג אפריל 1973, דוד אלעזר, רב אלוף, ראש המטה הכללי`, image: img1 },
    { id: 2,story:` ביום ה-5 ביוני 1967, בקרב על רפיח, נתקל הכוח של סרן דן שני ז"ל במתחמי אויב, שהכילו טנקים ותותחי נ"ט. תוך כדי לחימה בהם והשמדתם הופתע בהופעת טנקים מאחוריו. הוא שינה את כיוון פעולתו תוך כדי ירי ופגע בטנקי האויב. אותה שעה נפגעו מספר טנקים בכוח שלו, אך למרות שלאויב הייתה עדיפות מספרית, המשיך בלחימה ופגע בטנקי האויב. בסיום הקרב פינה פצועים והמשיך דרכו לצומת רפיח. על מעשה זה הוענק לו : עיטור המופת ניסן תשל"ג אפריל 1973, דוד אלעזר, רב אלוף, ראש המטה הכללי

`, image: img2 },
    { id: 3,story:` ביום ה-5 ביוני 1967, באזור כפר-שן, נפגע הטנק של סרן עמוס כץ והחל בוער. הוא קפץ מהטנק עם צוותו, לאחר שנכווה בכל חלקי גופו, עלה על טנק אחר והמשיך במשימתו. אותו יום השמיד כ-10 טנקים. ביום ה-6 ביוני, בחן-יונס, עלה הטנק שלו על מוקש. הוא החליף טנק והמשיך בלחימה על עזה. ביום ה-7 ביוני השתתף שנית בקרב על חן-יונס והמשיך לקנטרה. הוא שימש דוגמא אישית לאנשיו בהמשכו למלא את משימתו, למרות שנפצע. על מעשה זה הוענק לו : עיטור המופת ניסן תשל"ג אפריל 1973, דוד אלעזר, רב אלוף, ראש המטה הכללי`, image: img3 },
    { id: 4,story:`ביום ה-8 בספטמבר 1968, בזמן תקרית ארטילרית באזור התעלה, שימש סמ"ר מאיר יפרח כרב-סמל פלוגתי. תוך כדי התקרית נודע לו, שחייל נפצע ונמצא בשטח במרחק של כ-800 מטר מהבונקר בו הוא נמצא. סמ"ר מאיר יפרח התנדב ויצא מהבונקר תחת אש ארטילרית קשה ופינה את החייל הפצוע למקום מבטחים. על מעשה זה הוענק לו : עיטור המופת ניסן תשל"ג אפריל 1973, דוד אלעזר, רב אלוף, ראש המטה הכללי`, image: img4 },
    { id: 5,story:`ביום ה-5 ביוני 1967, באיזור כפר שן, נפגע זחל"ם תחת אש אויב. סג"ם עופר אבידב פינה את הפצועים ודאג לחבישתם. הוא אירגן כוח מתוך שני ג'יפי סיור וצוות טנק שנפגע, טהר את הבתים בסביבה מאויב, דאג לפינוי הפצועים לתחנת האיסוף הגדודית וכך הציל את חייהם. על מעשה זה הוענק לו : עיטור המופת ניסן תשל"ג אפריל 1973, דוד אלעזר, רב אלוף, ראש המטה הכללי`, image: img5 },
    { id: 6,story:`ביום ה-17 באפריל 1969, בגזרה הדרומית של תעלת סואץ, נשארו 17 עובדי הנדסה אזרחים בשטח פתוח, לאחר שהאויב פתח בהפגזת-פתע. לסג"ם אמנון ירושלמי ניתנה הוראה למצוא אותם ולהביאם למקום מחסה. הוא יצא בטנק ונע במהירות לכיוון מקום הימצאם המשוער. לאחר שלא מצאם, ירד מהטנק והמשיך את החיפוש ברגל תחת אש אויב. לאחר חיפושים שנמשכו כשעה גילה את האנשים מסתתרים בחפירה. הוא העבירם בעזרת הטנק למקום מחסה. על מעשה זה הוענק לו : עיטור המופת ניסן תשל"ג אפריל 1973, דוד אלעזר, רב אלוף, ראש המטה הכללי`, image: img6 },
    { id: 7,story:`ביום ה-11 באפריל 1970, הותקף סיור של כוחותינו באש תותחים של האויב, בגזרה הדרומית של תעלת-סואץ. מאש זו נפגע זחל"ם שהשתתף בסיור, ולוחמיו נפצעו. סג"ם צפריר איתן שהיה מפקד כח החיפוי של הסיור, חש מיד בכלי-הרכב שלו אל ה-זחל"ם שנפגע. תחת אש נ"ט, שבה נפגע כלי הרכב שתי פגיעות, חילץ סג"ם צפריר איתן את הפצועים, הכניסם לכלי הרכב והעבירם לטיפול רפואי. על מעשה זה הוענק לו : עיטור המופת ניסן תשל"ג אפריל 1973, דוד אלעזר, רב אלוף, ראש המטה הכלל`, image: img7 },
    { id: 8,story:` ביום ה-8 בספטמבר 1968, בזמן תקרית ארטילרית באזור התעלה בפורט-תופיק, שימש סמל שבתאי זכריה כמפקד טנק. עם תחילת התקרית נפגע הטנק מפגיעה ישירה, התותחן נפצע והתותח נפגע. סמל שבתאי זכריה חילץ את הפצוע תחת אש ארטילרית, המשיך באש אל עבר עמדות האויב והצליח להשמיד טנק אויב, כאשר הוא מפעיל את התותח הפגוע. על מעשה זה הוענק לו : עיטור המופת ניסן תשל"ג אפריל 1973, דוד אלעזר, רב אלוף, ראש המטה הכללי`, image: img8 },
    { id: 9,story:` ביום ה-5 ביוני 1967, בקרב על משלטי רפיח, תפס סמל יוסף פריינטה עמדה, כדי למשוך אש טנקים אליו ולאפשר על-ידי כך לטנקים שלנו להשמיד את טנקי האויב. בקרב על ג'יראדי נפגע הטנק שלו ונדלק. הוא נפצע ונכווה, אך עבר לטנק אחר והמשיך בלחימה. בתום הלחימה, כאשר הגיע לאל-עריש וכוחותיו אפסו, קיבל עזרה ופונה. על מעשה זה הוענק לו : עיטור המופת ניסן תשל"ג אפריל 1973, דוד אלעזר, רב אלוף, ראש המטה הכללי`, image: img9 },
    { id: 10, story:`ביום ה-5 ביוני 1967 בקרב על רפיח, פקד סגן עמירם גורן ז"ל על מחלקת טנקים אשר נתקלה בכוחות שריון ומערך נ"ט. סגן עמירם גורן ז"ל פרץ עם מחלקתו, הסתער על האויב, ובכך גרם להתמוטטות מערך האויב בגזרתו. בשלב האחרון של הלחימה נפגע הטנק שלו והוא נהרג. על מעשה זה הוענק לו : עיטור המופת ניסן תשל"ג אפריל 1973, דוד אלעזר, רב אלוף, ראש המטה הכללי`, image: img10 },
    { id: 11, story:` ביום ה-5 ביוני 1967, בכפר שן, נפגע הטנק שבו לחם סמל יוסף לפר. הוא קפץ מהטנק והמשיך להילחם ולטהר עמדות אויב עם צוותו. למחרת ניתן לו טנק אחר. טנק זה עלה על שדה מוקשים בחן-יונס ונשאר יחידי בשטח. סמל יוסף לפר המשיך להילחם יחידי מתוך הטנק, במשך 8 שעות רצופות, הפעיל את כלי הנשק והשמיד כל מי שניסה לפגוע בו, כשהוא מנותק מיחידתו. תוך כדי קרב נפצע בידו ובבטנו ולחם כשהוא פצוע, עד אשר חולץ. על מעשה זה הוענק לו : עיטור הגבורה ניסן תשל"ג אפריל 1973, משה דיין, שר הבטחון`, image: img11 },
    { id: 12, story:`ביום ה-5 ביוני 1967 בקרב על מוצבי רפיח, תפס סמל בני ענבר ז"ל עמדה עם טנק, בכוונה למשוך את אש האויב ועל ידי כך לאפשר לפלוגתו לאגף את האויב. תוך כדי פעולתו זו השמיד 5 טנקים ונפצע בעורפו. למרות שנפצע, לא עזב את תפקידו והמשיך בלחימה. בקרב במבואות אל-עריש, לאחר שפגע ב-3 טנקים ובמספר תותחי נ"ט, נפגע הטנק שלו. הוא וצוותו קפצו מהטנק. הוא נהרג מאש אויב, שהיה מחופר בשולי הכביש. על מעשה זה הוענק לו : עיטור הגבורה ניסן תשל"ג אפריל 1973, משה דיין, שר הבטחון`, image: img12 },
    { id: 13, story:`במלחמת יום-הכיפורים לחם רב"ט יאיר פלט ז"ל בתפקיד תותחן בצוות טנק בחזית סיני. בליל 7 באוקטובר 1973 נפגע הטנק של רב"ט יאיר פלט ז"ל ונהג הטנק ומפקדו נהרגו. רב"ט יאיר פלט ז"ל נותר לבדו כשהוא מכותר בכוחות חי"ר מצריים. למרות המצב הנואש שנקלע אליו, לא איבד רב"ט יאיר פלט ז"ל עשתונותיו והמשיך לנהל קרב אישי נגד האויב, תוך שהוא מדווח על מצבו ברשת הקשר ומבקש עזרה. כל הנסיונות לחלץ את רב"ט יאיר פלט ז"ל עלו בתוהו והדיווח האחרון שנתקבל ממנו ברשת הקשר היה, כי התחמושת שברשותו אזלה וכי כוחות האויב עולים עליו. רב"ט יאיר פלט ז"ל נפגע אז ונפל. במעשיו אלה גילה רב"ט יאיר פלט ז"ל אומץ לב, קור רוח ודבקות במשימה. הרצל שפיר - אלוף פיקוד הדרום`, image: img13 },
    { id: 14, story:`סגן שלום עין-גל שימש כמפקד פלוגת טנקים מסוג פאטון במלחמת ששת הימים. פלוגתו הובילה את החטיבה ופרצה את מערכי המצרים. במהלך לחימתו השמידה פלוגתו פלוגת טנקי סטאלין כבדים. לאורך הקרבות נקט סגן שלום עין-גיל יוזמה, מהירות פעולה, אומץ לב ותושיה שבזכותם זכה בהערכת האלוף. ישראל טל, אלוף מפקד גייסות השריון אוקטובר 1967`, image: img14 },

  ];
